apache/nuttx/arch/arm/src/stm32h7/stm32_capture.c
/****************************************************************************
 * arch/arm/src/stm32h7/stm32_capture.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/arch.h>
#include <nuttx/irq.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <arch/board/board.h>

#include "chip.h"
#include "arm_internal.h"
#include "stm32.h"
#include "stm32_gpio.h"
#include "stm32_capture.h"

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* Sanity checks ************************************************************/

#if !defined(CONFIG_STM32_STM32H7X3XX)
#  warning "This driver is for STM32H7X3XX devices"
#endif

/* Timer Channel Configuration **********************************************/

/* This module only compiles if there are enabled timers that are not
 * intended for some other purpose.
 */

#if defined(CONFIG_STM32_TIMX_CAP)

/* Check if any channel is enabled.
 * This is done to simplify the logic below.
 */

#if defined(GPIO_TIM1_CH1IN) || defined(GPIO_TIM2_CH1IN) || defined(GPIO_TIM3_CH1IN) || \
    defined(GPIO_TIM4_CH1IN) || defined(GPIO_TIM5_CH1IN) || defined(GPIO_TIM8_CH1IN) || \
    defined(GPIO_TIM12_CH1IN) || defined(GPIO_TIM13_CH1IN) || defined(GPIO_TIM14_CH1IN) || \
    defined(GPIO_TIM15_CH1IN) || defined(GPIO_TIM16_CH1IN) || defined(GPIO_TIM17_CH1IN) || \
    defined(GPIO_LPTIM1_CH1IN) || defined(GPIO_LPTIM2_CH1IN) || defined(GPIO_LPTIM3_CH1IN) || \
    defined(GPIO_LPTIM4_CH1IN) || defined(GPIO_LPTIM5_CH1IN)
#  define HAVE_CH1IN 1
#endif

#if defined(GPIO_TIM1_CH2IN) || defined(GPIO_TIM2_CH2IN) || defined(GPIO_TIM3_CH2IN) || \
    defined(GPIO_TIM4_CH2IN) || defined(GPIO_TIM5_CH2IN) || defined(GPIO_TIM8_CH2IN) || \
    defined(GPIO_TIM12_CH2IN) || defined(GPIO_TIM15_CH2IN) || \
    defined(GPIO_LPTIM1_CH2IN) || defined(GPIO_LPTIM2_CH2IN) || defined(GPIO_LPTIM3_CH2IN) || \
    defined(GPIO_LPTIM4_CH2IN) || defined(GPIO_LPTIM5_CH2IN)
#  define HAVE_CH2IN 1
#endif

#if defined(GPIO_TIM1_CH3IN) || defined(GPIO_TIM2_CH3IN) || defined(GPIO_TIM3_CH3IN) || \
    defined(GPIO_TIM4_CH3IN) || defined(GPIO_TIM5_CH3IN) || defined(GPIO_TIM8_CH3IN)
#  define HAVE_CH3IN 1
#endif

#if defined(GPIO_TIM1_CH4IN) || defined(GPIO_TIM2_CH4IN) || defined(GPIO_TIM3_CH4IN) || \
    defined(GPIO_TIM4_CH4IN) || defined(GPIO_TIM5_CH4IN) || defined(GPIO_TIM8_CH4IN)
#  define HAVE_CH4IN 1
#endif

#if defined(GPIO_TIM1_CH5IN) || defined(GPIO_TIM8_CH5IN)
#  define HAVE_CH5IN 1
#endif

#if defined(GPIO_TIM1_CH6IN) || defined(GPIO_TIM8_CH6IN)
#  define HAVE_CH6IN 1
#endif

/* Check if we have any advanced timers */

#if defined(CONFIG_STM32_TIM1_CAP) || defined(CONFIG_STM32_TIM8_CAP)
#  define USE_ADVANCED_TIM 1
#endif

/* Check if we have any general purpose timers */

#if defined(CONFIG_STM32_TIM2_CAP) || defined(CONFIG_STM32_TIM3_CAP) || \
    defined(CONFIG_STM32_TIM4_CAP) || defined(CONFIG_STM32_TIM5_CAP) || \
    defined(CONFIG_STM32_TIM12_CAP) || defined(CONFIG_STM32_TIM13_CAP) || \
    defined(CONFIG_STM32_TIM14_CAP) || defined(CONFIG_STM32_TIM15_CAP) || \
    defined(CONFIG_STM32_TIM16_CAP) || defined(CONFIG_STM32_TIM17_CAP)
#  define USE_GENERAL_TIM 1
#endif

/* Check if we have any low-power timers */

#if defined(CONFIG_STM32_LPTIM1_CAP) || defined(CONFIG_STM32_LPTIM2_CAP) || \
    defined(CONFIG_STM32_LPTIM3_CAP) || defined(CONFIG_STM32_LPTIM4_CAP) || \
    defined(CONFIG_STM32_LPTIM5_CAP)
#  define USE_LOWPOWER_TIM 1
#endif

/* Check for external clock signal */

#if defined(GPIO_TIM1_ETR_IN) || defined(GPIO_TIM2_ETR_IN) || defined(GPIO_TIM3_ETR_IN) || \
    defined(GPIO_TIM4_ETR_IN) || defined(GPIO_TIM5_ETR_IN) || defined(GPIO_TIM8_ETR_IN)
#  define USE_EXT_CLOCK 1
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* TIM Device Structure */

struct stm32_cap_priv_s
{
  const struct stm32_cap_ops_s *ops;
  const uint32_t base;      /* TIMn base address */
#ifdef USE_EXT_CLOCK
  const uint32_t gpio_clk;  /* TIMn base address */
#endif
  const int irq;            /* irq vector */
#ifdef USE_ADVANCED_TIM
  const int irq_of;         /* irq timer overflow is deferent in advanced timer */
#endif
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/* Get a 16-bit register value by offset */

static inline
uint16_t stm32_getreg16(const struct stm32_cap_priv_s *priv,
                        uint8_t offset)
{
  return getreg16(priv->base + offset);
}

/* Put a 16-bit register value by offset */

static inline void stm32_putreg16(const struct stm32_cap_priv_s *priv,
                                  uint8_t offset, uint16_t value)
{
  putreg16(value, priv->base + offset);
}

/* Modify a 16-bit register value by offset */

