apache/nuttx/arch/arm/src/stm32h7/stm32_capture.c
  return 0;
}

static inline int stm32_cap_set_rcc(const struct stm32_cap_priv_s *priv,
                                    bool on)
{
  uint32_t offset = 0;
  uint32_t mask   = 0;

  switch (priv->base)
    {
      /* APB2 Timers */

#ifdef CONFIG_STM32_TIM1_CAP
      case STM32_TIM1_BASE:
        offset = STM32_RCC_APB2ENR;
        mask   = RCC_APB2ENR_TIM1EN;
        break;
#endif
#ifdef CONFIG_STM32_TIM8_CAP
      case STM32_TIM8_BASE:
        offset = STM32_RCC_APB2ENR;
        mask   = RCC_APB2ENR_TIM8EN;
        break;
#endif
#ifdef CONFIG_STM32_TIM15_CAP
      case STM32_TIM15_BASE:
        offset = STM32_RCC_APB2ENR;
        mask   = RCC_APB2ENR_TIM15EN;
        break;
#endif
#ifdef CONFIG_STM32_TIM16_CAP
      case STM32_TIM16_BASE:
        offset = STM32_RCC_APB2ENR;
        mask   = RCC_APB2ENR_TIM16EN;
        break;
#endif
#ifdef CONFIG_STM32_TIM17_CAP
      case STM32_TIM17_BASE:
        offset = STM32_RCC_APB2ENR;
        mask   = RCC_APB2ENR_TIM17EN;
        break;
#endif

      /* APB1L Timers */

#ifdef CONFIG_STM32_TIM2_CAP
      case STM32_TIM2_BASE:
        offset = STM32_RCC_APB1LENR;
        mask   = RCC_APB1LENR_TIM2EN;
        break;
#endif
#ifdef CONFIG_STM32_TIM3_CAP
      case STM32_TIM3_BASE:
        offset = STM32_RCC_APB1LENR;
        mask   = RCC_APB1LENR_TIM3EN;
        break;
#endif
#ifdef CONFIG_STM32_TIM4_CAP
      case STM32_TIM4_BASE:
        offset = STM32_RCC_APB1LENR;
        mask   = RCC_APB1LENR_TIM4EN;
        break;
#endif
#ifdef CONFIG_STM32_TIM5_CAP
      case STM32_TIM5_BASE:
        offset = STM32_RCC_APB1LENR;
        mask   = RCC_APB1LENR_TIM5EN;
        break;
#endif
      /* TIM6 and TIM7 cannot be used in capture */
#ifdef CONFIG_STM32_TIM12_CAP
      case STM32_TIM12_BASE:
        offset = STM32_RCC_APB1LENR;
        mask   = RCC_APB1LENR_TIM12EN;
        break;
#endif
#ifdef CONFIG_STM32_TIM13_CAP
      case STM32_TIM13_BASE:
        offset = STM32_RCC_APB1LENR;
        mask   = RCC_APB1LENR_TIM13EN;
        break;
#endif
#ifdef CONFIG_STM32_TIM14_CAP
      case STM32_TIM14_BASE:
        offset = STM32_RCC_APB1LENR;
        mask   = RCC_APB1LENR_TIM14EN;
        break;
#endif
#ifdef CONFIG_STM32_LPTIM1_CAP
      case STM32_LPTIM1_BASE:
        offset = STM32_RCC_APB1LENR;
        mask   = RCC_APB1LENR_LPTIM1EN;
        break;
#endif

      /* APB4 Timers */

#ifdef CONFIG_STM32_LPTIM2_CAP
      case STM32_LPTIM2_BASE:
        offset = STM32_RCC_APB4ENR;
        mask   = RCC_APB4ENR_LPTIM2EN;
        break;
#endif
#ifdef CONFIG_STM32_LPTIM3_CAP
      case STM32_LPTIM3_BASE:
        offset = STM32_RCC_APB4ENR;
        mask   = RCC_APB4ENR_LPTIM3EN;
        break;
#endif
#ifdef CONFIG_STM32_LPTIM4_CAP
      case STM32_LPTIM4_BASE:
        offset = STM32_RCC_APB4ENR;
        mask   = RCC_APB4ENR_LPTIM4EN;
        break;
#endif
#ifdef CONFIG_STM32_LPTIM5_CAP
      case STM32_LPTIM5_BASE:
        offset = STM32_RCC_APB4ENR;
        mask   = RCC_APB4ENR_LPTIM5EN;
        break;
#endif

      default:
        return -EINVAL;
    }

  if (on)
    {
      modifyreg32(offset, 0, mask);
    }
  else
    {
      modifyreg32(offset, mask, 0);
    }

  return OK;
}

/****************************************************************************
 * Basic Functions
 ****************************************************************************/

static int stm32_cap_setclock(struct stm32_cap_dev_s *dev,
                              uint32_t freq, uint32_t max)
{
  const struct stm32_cap_priv_s *priv = (const struct stm32_cap_priv_s *)dev;
  uint32_t freqin;
  int prescaler;

  /* Disable Timer? */

  if (freq == 0)
    {
      /* Disable Timer */

      stm32_modifyreg16(priv, STM32_BTIM_CR1_OFFSET, ATIM_CR1_CEN, 0);
      return 0;
    }

  /* Get the input clock frequency for this timer.  These vary with
   * different timer clock sources, MCU-specific timer configuration, and
   * board-specific clock configuration.  The correct input clock frequency
   * must be defined in the board.h header file.
   */

  switch (priv->base)
    {
#ifdef CONFIG_STM32_TIM1
      case STM32_TIM1_BASE:
        freqin = STM32_APB2_TIM1_CLKIN;
        break;
#endif
#ifdef CONFIG_STM32_TIM2
      case STM32_TIM2_BASE:
        freqin = STM32_APB1_TIM2_CLKIN;
        break;
#endif
#ifdef CONFIG_STM32_TIM3
      case STM32_TIM3_BASE:
        freqin = STM32_APB1_TIM3_CLKIN;
        break;
#endif
#ifdef CONFIG_STM32_TIM4
      case STM32_TIM4_BASE:
        freqin = STM32_APB1_TIM4_CLKIN;
        break;
#endif
#ifdef CONFIG_STM32_TIM5
      case STM32_TIM5_BASE:
        freqin = STM32_APB1_TIM5_CLKIN;
        break;
#endif
#ifdef CONFIG_STM32_TIM8
      case STM32_TIM8_BASE:
        freqin = STM32_APB2_TIM8_CLKIN;
        break;
#endif
#ifdef CONFIG_STM32_TIM9
      case STM32_TIM9_BASE:
        freqin = STM32_APB2_TIM9_CLKIN;
        break;
#endif
#ifdef CONFIG_STM32_TIM10
      case STM32_TIM10_BASE:
        freqin = STM32_APB2_TIM10_CLKIN;
        break;
#endif
#ifdef CONFIG_STM32_TIM11
      case STM32_TIM11_BASE:
        freqin = STM32_APB2_TIM11_CLKIN;
        break;
#endif
#ifdef CONFIG_STM32_TIM12
      case STM32_TIM12_BASE:
        freqin = STM32_APB1_TIM12_CLKIN;
        break;
#endif
#ifdef CONFIG_STM32_TIM13
      case STM32_TIM13_BASE:
        freqin = STM32_APB1_TIM13_CLKIN;
        break;
#endif
#ifdef CONFIG_STM32_TIM14
      case STM32_TIM14_BASE:
        freqin = STM32_APB1_TIM14_CLKIN;
        break;
#endif

      default:
        return -EINVAL;
    }

  /* Select a pre-scaler value for this timer using the input clock
   * frequency.
   */

  prescaler = freqin / freq;

  /* We need to decrement value for '1', but only, if we are allowed to
   * not to cause underflow. Check for overflow.
   */

  if (prescaler > 0)
    {
      prescaler--;
    }

  if (prescaler > 0xffff)
    {
      prescaler = 0xffff;
    }

  /* Set Maximum */

  stm32_putreg32(priv, STM32_BTIM_ARR_OFFSET, max);

  /* Set prescaler */

  stm32_putreg16(priv, STM32_BTIM_PSC_OFFSET, prescaler);

